# BuiltInFailures.DPartFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures Class
BuiltInFailures Class Members See Also
---
Failures related to parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DPartFailures
```

Visual Basic
---
```text
Public NotInheritable Class DPartFailures
```

Visual C++
---
```text
public ref class DPartFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DPartFailures
# See Also
BuiltInFailures..::..DPartFailures Members
Autodesk.Revit.DB Namespace